music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "john"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, pw)
        match = self.find_by(email: email)

SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "YPoqlirs9f6s98cmfhLfEum87FvT6tfJYzxH7VVEKTA"], ["LIMIT", 1]]
---
    def generate_session_token
        loop do
            token = SecureRandom::urlsafe_base64(32)
            return token unless self.class.exists?(session_token: token)